#+TITLE: recording my instanity
#+AUTHOR: Ornyx (duh)

* Preface (so fancy omg)
As is custom at this point this document will serve as a day to day recap of
progress when i'm working on this emulator... Unless I forget, so like expect
random jumps and stuff.

But yeah, enjoy me slowly losing it

* Day Two <2024-06-07 Fri>
:LOGBOOK:
CLOCK: [2024-06-07 Fri 12:26]--[2024-06-07 Fri 17:53] =>  5:27
:END:
Did some more of the like CPU instructions and sutff. ngl completely forgot to
write here

* Day Three <2024-06-10 Mon>
:LOGBOOK:
CLOCK: [2024-06-10 Mon 12:28]--[2024-06-10 Mon 17:49] =>  5:21
:END:

Waow... what a day. I uh, did way too much

Like I've basically been following the guide and doing whatever it does, but I
think I'm gonna do some major refactoring soon because a lot of the shit in that
guide is like really gross.
Like it's really weird some of the decisions they made tbh.

But yeah just been working on more of the instructions and memory map and
stuff. also.
FUCK the FUCKING memory map on the stupid psx spx site. it is the most confusing
thing ever. Like most of the things don't tell you how large the stuff is and
the guide likes to leave out some vital information. Like it's fine not telling
the basic shit but when you suddenly drop some random new memory range onto us
and not tell us where it starts or how long it is it's confusing as fuck because
the documentation doesn't tell you shit lmao, so atm i've got a bunch of guesses
for that stuff and I'm waiting for it to collapse.

Also god damn does this guy go back and forth between redoing half the codebase,
like yeah sure tell the reader "okay now go back and change everything"
Also like why does he do it twice in one small section, like he goes "okay now
change everything to use currentpc" and then he goes "hmm, nah that's not right,
change it again to do this" like... why not just do the second one, or describe
why the first doesn't work etc etc.

Also i suck at reading, like badly. I CANNOT to ranges on my own lmao, so it
sucks they aren't nicely there and shit.

But yeah, i see a lot of refactoring in my future, probs gonna revamp the
instruction system so it's a massive array like last time lmao

* Day Four <2024-06-11 Tue>
:LOGBOOK:
CLOCK: [2024-06-11 Tue 10:34]--[2024-06-11 Tue 17:54] =>  7:20
:END:

Today was certainly a day. Finished off the CPU (for now) and got all the
instructions implemented etc. I'll need to go back to it later but for now it
works.

But yeah, onto the GPU and god damn do i hate that documentation, why is
everything so confusing lmao. But yeah hopefully we should be getting some shit
displaying soon.
Also I've started deviating from the guide a bit as it's got some weird
confusing stuff that differs from what the docs say

Short update today but i'm too tired and it wasn't really that interesting.
Oh yeah I also like changed around the CPU instruction system to use an array
and stuff yesterday if that counts.

* Day Five <2024-06-17 Mon>
:LOGBOOK:
CLOCK: [2024-06-17 Mon 20:33]--[2024-06-17 Mon 22:13] =>  1:40
CLOCK: [2024-06-17 Mon 16:37]--[2024-06-17 Mon 17:52] =>  1:15
:END:

Didn't do much today, was studying for exam and shit so did a bit for the gpu
but that was mostly it. I think i changed around my GP0 command shit so it uses
a map now but i can't rember

* Day Six <2024-06-18 Tue>
:LOGBOOK:
CLOCK: [2024-06-18 Tue 20:11]--[2024-06-18 Tue 23:04] =>  2:53
:END:

I did some stuff today, did some more work on the GPU and am now onto working
on the openGL stuff. not much to say kinda bad at writing atm, i'll do a big
update soon probs...

* Day Seven <2024-06-20 Thu>
:LOGBOOK:
CLOCK: [2024-06-20 Thu 20:45]--[2024-06-21 Fri 00:41] =>  3:56
:END:

Despite being dead inside on my bed I got quite a bit done tonight. I managed to
get the first bits rendering onto the screen so we're winning.
I zoned out for a bit so time is a bit innacurate but it's going alright
